Revit 2027 API
BendingDetailCustomFieldProperties.AngularDimensionsEnabled Property
 Identifies if any angular dimensions will be shown or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AngularDimensionsEnabled { get; set; }
Public Property AngularDimensionsEnabled As Boolean
	Get
	Set
public:
property bool AngularDimensionsEnabled {
	bool get ();
	void set (bool value);
}
member AngularDimensionsEnabled : bool with get, set
Property Value
Boolean
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace